{
  "flowMeter": "Working at Brickeye as a hardware developer, one of my projects was this jig. More specifically, my task was to create a system that was able to host multiple ultrasonic flow meters on multiple pipelines with a control in-line flow meter on each, manually calibrated to the correct rate. Ideally the pipes would be able to be swapped to simulate different conditions (comparing things like copper versus PVC and turbulent versus laminar flow). I designed the jig using AutoCAD and built the first prototype with an Arduino, pulse counters, float switch, and other sensor inputs taking into consideration the many challenges of using ultrasonic flow meters which have very specific upstream/downstream requirements. The completed project was organized into an electrical box that I outfitted with the appropriate connectors and can run autonomously without running the pump dry or interrupting the pipelines laminar flow.",
  "chromeExtension": "This Chrome Extension was inspired by the 'Locket' iOS widget. It enables users to share common Chrome backgrounds with their groups. Groups are user created and password protected. It makes use of a Python and flask virtual environment. My contribution was front-end based, coded in Javascript, HTML and CSS. My largest additions were the search bar logic, clock logic and the Git logo. I also practiced project management as I connected with my teammates in order to complete the extension. Our extension was approved for the Google Chrome store as of July 2023.",
  "measurementDevice": "The heart of this project is the combination of an ultrasonic sensor and a stepper motor. Using an Arduino and related accessories (LCD screen, joystick, etc.), my team and I created a device to measure small objects. The goal of this project was to be able to measure lego blocks and other small objects without using a ruler or conventional measurement device. To avoid using these we started a stepper motor with an ultrasonic sensor attached to the motor shaft and detected whether an object was present and as well as the number of steps it was present for. We then converted the step count into a length using the relationship between steps and distance. This project was completed in coordination with MTE201: Experimental Measurement and Statistical Analysis.",
  "balsaBridge": "This project was complete for MTE219: Mechanics of Deformable Solids where myself and a group designed a bridge with the goal of having the best supported weight to bridge weight ratio. We were limited by the project specifications, the biggest of which was that the bridge had to be made from laser cut balsa wood and plywood dowels. Our final design took into the consideration the mechanics of deformable solids and our calculated modes of failure for the structure. We optimized our truss patterns and then our member designs as well taking specific care to identify which would be under tension and compression. Our structure broke after holding 10kg of weight, meaning it held 396.83 times its own weight!",
  "legoEV3": "My groupmates and I modified an existing Lego EV3 robot to interact with a physical Mario Kart inspired course. The robot not only has the addition of a plastic ball shooter but also a taller set of wheels and a pointed front bumper capable of directing obstacles out of the given path. Using RobotC I coded several functions triggered by the sensors outfitted on the robot. For example, when the robot encounters a green strip, representing grass, it reduces its speed and turns back onto the main track. When it encounters a rainbow strip, it increases speed until three seconds have passed or the front bumper removes an obstacle from the path.",
  "discordBot": "This project was inspired by the age-old question: what are barriers for women, or gender minorities, in STEM? My team and I addressed this issue by tackling an issue that we have faced before in order to create a solution to a problem that many people face. Introducing WonderWoman, the discord bot programmed to be a balance of empowerment for gender minorities and a punisher for those who combat inclusivity with gender-based harassment. The bot, developed in Python using the discord.py library/api wrapper, has three main components: flagging sexist comments/terms, sending empowering quotations, and challenging with users through a trivia game. My contribution was the prototype for flagging sexist comments/terms as well as acting as project manager throughout the hackathon in which the project was completed.",
  "aboutMe1": "My name is Kate Bendall and I am a 2B Honours Mechatronics Engineering student at the University of Waterloo. I am striving to build my technical skills through personal projects, job experience and in-class teachings, but I promise you there's more to learn about me than just my technical qualifications...",
  "aboutMe2": "Growing up, I spent most of my time playing sports, trying every position on my ice hockey team before finding my fit at goalie. I played lacrosse throughout childhood as well, but trying goalie there didn't go as well, instead spending time racing through games as a midfielder. In high school, I picked up field hockey and supported my team through rain or shine. In short, I've tried a ton of sports, whether it's rowing and rock climbing to volleyball, tennis, or golf, it's safe to say I was destined to choose a university program nicknamed the Jack of All Trades. These days, I stay active with runs around Waterloo Park and the Huron Nature Area, volleyball intramurals, and kickboxing classes.",
  "aboutMe3": "While on school terms I spend most of my time in class but still I am determined to find time for my other passions. Like sports, one of those passions is planning, managing and volunteering in outreach events. This lead me to participate in a variety of Engineering Society positions and other campus-wide initiatives. I am in my second term as the Outreach Commissioner for the Society, where I plan engineering-wide events and manage my team of directors who are also planning outreach and fundraising style events on and off campus. I've also held the Education Outreach Directorship, EngSoc class representative position and have been an Engineering Ambassador, working in EngChats and other recruitment efforts like goENG girl, an event dedicated to sparking an engineering passion in tween girls. Additionally, each year I participate as an Orientation Week Leader! Leading my colour teams through a rigorous first week of class, competing with crazy activities and practically painting the city purple have all been my responsibility as a leader... keeping us organized and on time as well as responding to emergency situations with tact and practicing a constant appreciation for EDI are the cherries on top. My work through TEDxUW has been highly focused in speaker recruitment and team management. In the 2022 conference, I held the role of Speaker Relations Associate and emcee/host where I was able to communicate with a variety of exceptional individuals all eager to bring their 'ideas worth sharing' to our stage. This year I was promoted to Speaker Relations Director where I manage the team I used to be a part of. We have a top-of-the-line speaking group this year and we are deep in planning for our October 1st conference date.",
  "aboutMe4": "I'm looking forward to continuing to make my way through class, co-op and the other parts of my life that aren't spent on campus. If there's anything else you would like to know my job qualifications, goals for the future or if you're just looking to chat, you can reach me at kbendall@uwaterloo.ca or through LinkedIn. Thanks!"
}
