{
  "socialChess": "This winter I had the privilege to work in Norway as a social robotics programmer in AI research. I worked with a Furhat social robot throughout my time there. My most significant project was implementing a use case for the game of chess whereas the social robot would compete against a user. The robot interface was programmed using Kotlin and the Furhat SDK. The backend of the code was hosted using an Amazon Web Services EC2 Instance and the programs were run on a Docker instance with Python code. The program includes a GUI that matches the verbally communicated moves from the user and the robot’s moves (powered by Stockfish). This project and its resulting presentations and conference demonstrations taught me invaluable information about human-robot interactions and have enlightened me about how artificial intelligence and the user experience cooperate. The robot and I were also featured on the cover of the NorwAI 2023 Annual Report.",
  "robertsRules": "This project addresses the need for crowd control in Student Council meetings. The inspiration was taken from the Engineering Society which follows Robert’s Rules hand signals in order to organize a room of representatives. Based on these hand signals and when the hand is raised, the Society speaker will manage the flow of conversation. However, the speaker has other responsibilities that could distract them from this role. It can be difficult to maintain the correct flow and this program would assist in that. It uses OpenCV and custom Haars Cascade Classifiers to identify hand signals which are then ordered based on their meaning. Once a user is added to the list, they can then lower their hand and their response will be remembered unless they make a second signal canceling their original.",
  "cannyEdge": "As a part of the course MTE203: Advanced Calculus, I created a canny edge detection program. The program was developed without relying on external MATLAB libraries. Canny edge detection is one of the most robust image processing techniques and continues to expand the applications and implementations of computer vision by using advanced calculus concepts. First the image is prepped by converting it to grayscale and blurring it. Both of these are done using Then, the gradient of the image is taken to determine the direction and magnitude of the change in intensity of the image. From this point on the values of the gradient are judged based on the values of their surrounding pixels to reveal the local maximums of intensity along the gradient’s respective paths. Finally, thresholds are applied to the remaining pixels and the true edges are output whereas the ambiguous ones are additionally scrutinized.",
  "flowMeter": "Working at Brickeye as a hardware developer, one of my projects was this testing jig. More specifically, my task was to create a system that was able to host multiple ultrasonic flow meters on multiple pipelines with a control in-line flow meter on each, manually calibrated to the correct rate. The pipes are able to be swapped to simulate different conditions (comparing materials like copper versus PVC and conditions like turbulent versus laminar flow). I designed the jig using Solidworks and built the first prototype with an Arduino, pulse counters, float switches, and the control sensor inputs – taking into consideration the many challenges of using ultrasonic flow meters which have very specific upstream and downstream requirements. The completed project was organized into an electrical box that I outfitted with the appropriate connectors and can run autonomously for an indefinite amount of time.",
  "chromeExtension": "This Chrome Extension was inspired by the 'Locket' iOS widget. It enables users to share common Chrome backgrounds with their groups. Groups are user created and password protected. It makes use of a Python and flask virtual environment. My contribution was front-end based, coding in Javascript, HTML and CSS. I also practiced project management as I connected with my teammates in order to complete the extension. Our extension was approved for the Google Chrome store as of July 2023.",
  "measurementDevice": "The heart of this project is the combination of an ultrasonic sensor and a stepper motor. Using an Arduino and related accessories (LCD screen, joystick, etc.), my team and I created a device to measure small objects. The goal of this project was to be able to measure lego blocks and other small objects without using a ruler or conventional measurement device. To avoid using these we started a stepper motor with an ultrasonic sensor attached to the motor shaft and detected whether an object was present and as well as the number of steps it was present for. We then converted the step count into a length using the relationship between steps and distance. This project was completed in coordination with MTE201: Experimental Measurement and Statistical Analysis.",
  "balsaBridge": "This project was completed for MTE219: Mechanics of Deformable Solids where myself and a group designed a bridge with the goal of having the best supported weight to bridge weight ratio. We were limited by the project specifications, the biggest of which was that the bridge had to be made from laser cut balsa wood and plywood dowels. Our final design took into the consideration the mechanics of deformable solids and our calculated modes of failure for the structure. We optimized our truss patterns and then our member designs as well taking specific care to identify which would be under tension and compression. Our structure broke after holding 10kg, meaning it held 396.83 times its own weight!",
  "legoEV3": "My group mates and I modified an existing Lego EV3 robot to interact with a physical Mario Kart inspired course. The robot not only has the addition of a plastic ball shooter but also a taller set of wheels and a pointed front bumper capable of directing obstacles out of the given path. Using RobotC, I programmed several functions triggered by the sensors outfitted on the robot. For example, when the robot encounters a green strip, representing grass, it reduces its speed and turns back onto the main track. When it encounters a rainbow strip, it increases speed until three seconds have passed or the front bumper removes an obstacle from the path.",
  "discordBot": "This project was inspired by the age-old question: what are barriers for women, or gender minorities, in STEM? My team and I addressed this issue by tackling an issue that we have faced before in order to create a solution to a problem that many people face. Introducing WonderWoman, the discord bot programmed to be a balance of empowerment for gender minorities and a punisher for those who combat inclusivity with gender-based harassment. The bot, developed in Python using the discord.py library/api wrapper, has three main components: flagging sexist comments/terms, sending empowering quotations, and challenging with users through a trivia game. My contribution was the prototype for flagging sexist comments/terms as well as acting as project manager throughout the hackathon in which the project was completed.",
  "aboutMe1": "My name is Kate Bendall, and I am a student at the University of Waterloo, where I am working towards my Bachelor of Applied Science in Honours Mechatronics Engineering. I am striving to build my technical skills through personal projects, job experience, and my studies, but I promise you there's more to learn about me than just my technical qualifications.",
  "aboutMe2": "Growing up, I spent most of my time playing sports, trying every position on my ice hockey team before finding my fit at goalie. I played lacrosse throughout childhood as well, but instead spent time racing through games as a midfielder. In high school, I even picked up field hockey and, back at goalie, supported my team through rain or shine. In short, I've tried a ton of sports, whether it's rowing and rock climbing to volleyball, tennis, or golf, it's safe to say I was destined to choose a university program that would teach me to be a technical Jack of All Trades. These days, I stay active with runs around Waterloo Park and the Huron Nature Area, ultimate frisbee intramurals, and kickboxing classes at the University.",
  "aboutMe3": "While on school terms, I spend most of my time attending classes, but I still find time for my other passions. Just like sports, another one of those passions is managing outreach events. This led me to participate in a variety of Engineering Society (EngSoc) positions and other campus-wide initiatives. I am in my third term as the Outreach Commissioner for the Society, where I plan engineering-wide events and manage my team of directors who are also planning community outreach and fundraising style events both on and off campus. Recently we’ve raised money for Grand River Hospital Children’s Wing with a bus push from UW to downtown Kitchener, helped out Spectrum KW with a Patch Auction, made hygiene kits for the YWCA Women’s Shelter and have hosted a blood donation run and a plasma donation registry booth! We have plenty of exciting initiatives coming up this Spring as well including a trip to Toronto’s Pride Parade and other community collaborations.",
  "aboutMe4": "I've also been the EngSoc Director of Education Outreach, an EngSoc class representative, an Engineering Ambassador (working in EngChats and other recruitment efforts like goENG girl). Additionally, each year of my undergrad I have participated as an Orientation Week Leader! Leading my colour teams through a rigorous first week of classes, competing in spirited activities and painting the city purple with engineering pride have all been my responsibility as a leader. Keeping us organized as well as responding to emergency situations with tact and practicing a constant appreciation for EDI have also been important responsibilities. I’ve held specific additional roles in inter-team communication, first aid, and acquiring sponsorships that have exercised a variety of my event planning and interpersonal skills.",
  "aboutMe5": "Outside of the world of engineering, I also have been an active member of TEDxUW! My work through the club has been highly focused on speaker recruitment and team management. At the 2022 conference, I held the role of Speaker Relations Associate and emcee/host where I was able to communicate with a variety of exceptional individuals all eager to bring their 'ideas worth sharing' to our stage. Last year I was promoted to Speaker Relations Director where I held an executive role for the club, managing the team I used to be a part of. We, once again, recruited and welcomed a top-of-the-line speaking group to the University of Waterloo for our conference. Their speeches can be viewed on TEDxUW’s YouTube page.",
  "aboutMe6": "I'm looking forward to continuing to make my way through class, co-op, and everything I spend my time doing in between. If there's anything else you would like to know about my job qualifications, goals for the future, or if you're just looking to chat, you can reach me at kbendall@uwaterloo.ca or through LinkedIn. Thanks!"
}
